; domain
(define (domain drone-domain)


(:requirements :strips :typing )


(:types
    person crate food medicine location drone - object
)


(:predicates
    (at ?o - object ?l - location)
    (crate-content ?b - crate ?content - object)
    (person-needs ?p - person ?content - object)
    (person-has ?p - person ?content - object)
    (arm1-free ?d - drone)
    (arm1-load ?d - drone ?b - crate)
    (arm2-free ?d - drone)
    (arm2-load ?d - drone ?b - crate)
)


(:action move-drone
    :parameters (
        ?drone - drone ?origin - location ?destination - location 
    )
    :precondition (and 
        (at ?drone ?origin)
    )
    :effect (and 
        (not (at ?drone ?origin))
        (at ?drone ?destination)
    )
)

(:action grab-arm1
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm1-free ?d)
    )
    :effect (and 
        (not (arm1-free ?d))
        (arm1-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action grab-arm2
    :parameters (
        ?d - drone ?b - crate ?l - location
    )
    :precondition (and 
        (at ?d ?l)
        (at ?b ?l)
        (arm2-free ?d)
    )
    :effect (and 
        (not (arm2-free ?d))
        (arm2-load ?d ?b)
        (not (at ?b ?l))
    )
)

(:action deliver-arm1
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm1-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm1-load ?d ?b))
        (arm1-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)

(:action deliver-arm2
    :parameters (
        ?d - drone ?p - person ?b - crate ?content - object ?l - location
    )
    :precondition (and 
        (arm2-load ?d ?b)
        (at ?d ?l)
        (at ?p ?l)
        (crate-content ?b ?content)
        (person-needs ?p ?content)
    )
    :effect (and 
        (not (arm2-load ?d ?b))
        (arm2-free ?d)
        (not (person-needs ?p ?content))
        (person-has ?p ?content)
    )
)


)

; problem
(define (problem drone_problem_d1_r0_l18_p18_c18_g18_ct2)
(:domain drone-domain)
(:objects
	drone1 - drone
	depot - location
	loc1 - location
	loc2 - location
	loc3 - location
	loc4 - location
	loc5 - location
	loc6 - location
	loc7 - location
	loc8 - location
	loc9 - location
	loc10 - location
	loc11 - location
	loc12 - location
	loc13 - location
	loc14 - location
	loc15 - location
	loc16 - location
	loc17 - location
	loc18 - location
	crate1 - crate
	crate2 - crate
	crate3 - crate
	crate4 - crate
	crate5 - crate
	crate6 - crate
	crate7 - crate
	crate8 - crate
	crate9 - crate
	crate10 - crate
	crate11 - crate
	crate12 - crate
	crate13 - crate
	crate14 - crate
	crate15 - crate
	crate16 - crate
	crate17 - crate
	crate18 - crate
	food - contents
	medicine - contents
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	person11 - person
	person12 - person
	person13 - person
	person14 - person
	person15 - person
	person16 - person
	person17 - person
	person18 - person
)
(:init
	(at drone1 depot)
	(arm1-free drone1)
	(arm2-free drone1)
	(at crate1 depot)
	(at crate2 depot)
	(at crate3 depot)
	(at crate4 depot)
	(at crate5 depot)
	(at crate6 depot)
	(at crate7 depot)
	(at crate8 depot)
	(at crate9 depot)
	(at crate10 depot)
	(at crate11 depot)
	(at crate12 depot)
	(at crate13 depot)
	(at crate14 depot)
	(at crate15 depot)
	(at crate16 depot)
	(at crate17 depot)
	(at crate18 depot)
	(crate-content crate1 food)
	(crate-content crate2 food)
	(crate-content crate3 food)
	(crate-content crate4 food)
	(crate-content crate5 food)
	(crate-content crate6 food)
	(crate-content crate7 food)
	(crate-content crate8 food)
	(crate-content crate9 food)
	(crate-content crate10 food)
	(crate-content crate11 food)
	(crate-content crate12 food)
	(crate-content crate13 food)
	(crate-content crate14 food)
	(crate-content crate15 medicine)
	(crate-content crate16 medicine)
	(crate-content crate17 medicine)
	(crate-content crate18 medicine)
	(at person1 loc17)
	(at person2 loc8)
	(at person3 loc3)
	(at person4 loc6)
	(at person5 loc6)
	(at person6 loc13)
	(at person7 loc6)
	(at person8 loc6)
	(at person9 loc2)
	(at person10 loc6)
	(at person11 loc17)
	(at person12 loc9)
	(at person13 loc3)
	(at person14 loc14)
	(at person15 loc7)
	(at person16 loc8)
	(at person17 loc4)
	(at person18 loc1)
	(person-needs person1 food)
	(person-needs person2 food)
	(person-needs person2 medicine)
	(person-needs person3 food)
	(person-needs person4 food)
	(person-needs person5 food)
	(person-needs person6 food)
	(person-needs person7 food)
	(person-needs person7 medicine)
	(person-needs person9 medicine)
	(person-needs person10 food)
	(person-needs person13 food)
	(person-needs person14 food)
	(person-needs person15 food)
	(person-needs person16 food)
	(person-needs person17 food)
	(person-needs person17 medicine)
	(person-needs person18 food)
)
(:goal (and
	(at drone1 depot)
	(person-has person1 food)
	(person-has person2 food)
	(person-has person2 medicine)
	(person-has person3 food)
	(person-has person4 food)
	(person-has person5 food)
	(person-has person6 food)
	(person-has person7 food)
	(person-has person7 medicine)
	(person-has person9 medicine)
	(person-has person10 food)
	(person-has person13 food)
	(person-has person14 food)
	(person-has person15 food)
	(person-has person16 food)
	(person-has person17 food)
	(person-has person17 medicine)
	(person-has person18 food)
	))
)

; plan
1. (grab-arm2 drone1 crate18 depot)
   deleted: (arm2-free drone1) (at crate18 depot)
   added: (arm2-load drone1 crate18)
   goals met: 1 of 19
2. (grab-arm1 drone1 crate16 depot)
   deleted: (arm1-free drone1) (at crate16 depot)
   added: (arm1-load drone1 crate16)
   goals met: 1 of 19
3. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 0 of 19
4. (deliver-arm1 drone1 person7 crate16 medicine loc6)
   deleted: (arm1-load drone1 crate16) (person-needs person7 medicine)
   added: (arm1-free drone1) (person-has person7 medicine)
   goals met: 1 of 19
5. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 2 of 19
6. (grab-arm1 drone1 crate15 depot)
   deleted: (arm1-free drone1) (at crate15 depot)
   added: (arm1-load drone1 crate15)
   goals met: 2 of 19
7. (move-drone drone1 depot loc2)
   deleted: (at drone1 depot)
   added: (at drone1 loc2)
   goals met: 1 of 19
8. (deliver-arm1 drone1 person9 crate15 medicine loc2)
   deleted: (arm1-load drone1 crate15) (person-needs person9 medicine)
   added: (arm1-free drone1) (person-has person9 medicine)
   goals met: 2 of 19
9. (move-drone drone1 loc2 depot)
   deleted: (at drone1 loc2)
   added: (at drone1 depot)
   goals met: 3 of 19
10. (grab-arm1 drone1 crate17 depot)
   deleted: (arm1-free drone1) (at crate17 depot)
   added: (arm1-load drone1 crate17)
   goals met: 3 of 19
11. (move-drone drone1 depot loc4)
   deleted: (at drone1 depot)
   added: (at drone1 loc4)
   goals met: 2 of 19
12. (deliver-arm1 drone1 person17 crate17 medicine loc4)
   deleted: (arm1-load drone1 crate17) (person-needs person17 medicine)
   added: (arm1-free drone1) (person-has person17 medicine)
   goals met: 3 of 19
13. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 4 of 19
14. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 3 of 19
15. (deliver-arm2 drone1 person2 crate18 medicine loc8)
   deleted: (arm2-load drone1 crate18) (person-needs person2 medicine)
   added: (arm2-free drone1) (person-has person2 medicine)
   goals met: 4 of 19
16. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 5 of 19
17. (grab-arm2 drone1 crate13 depot)
   deleted: (arm2-free drone1) (at crate13 depot)
   added: (arm2-load drone1 crate13)
   goals met: 5 of 19
18. (grab-arm1 drone1 crate8 depot)
   deleted: (arm1-free drone1) (at crate8 depot)
   added: (arm1-load drone1 crate8)
   goals met: 5 of 19
19. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 4 of 19
20. (deliver-arm1 drone1 person5 crate8 food loc6)
   deleted: (arm1-load drone1 crate8) (person-needs person5 food)
   added: (arm1-free drone1) (person-has person5 food)
   goals met: 5 of 19
21. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 6 of 19
22. (grab-arm1 drone1 crate2 depot)
   deleted: (arm1-free drone1) (at crate2 depot)
   added: (arm1-load drone1 crate2)
   goals met: 6 of 19
23. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 5 of 19
24. (deliver-arm2 drone1 person4 crate13 food loc6)
   deleted: (arm2-load drone1 crate13) (person-needs person4 food)
   added: (arm2-free drone1) (person-has person4 food)
   goals met: 6 of 19
25. (move-drone drone1 loc6 loc13)
   deleted: (at drone1 loc6)
   added: (at drone1 loc13)
   goals met: 6 of 19
26. (deliver-arm1 drone1 person6 crate2 food loc13)
   deleted: (arm1-load drone1 crate2) (person-needs person6 food)
   added: (arm1-free drone1) (person-has person6 food)
   goals met: 7 of 19
27. (move-drone drone1 loc13 depot)
   deleted: (at drone1 loc13)
   added: (at drone1 depot)
   goals met: 8 of 19
28. (grab-arm2 drone1 crate9 depot)
   deleted: (arm2-free drone1) (at crate9 depot)
   added: (arm2-load drone1 crate9)
   goals met: 8 of 19
29. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 7 of 19
30. (deliver-arm2 drone1 person7 crate9 food loc6)
   deleted: (arm2-load drone1 crate9) (person-needs person7 food)
   added: (arm2-free drone1) (person-has person7 food)
   goals met: 8 of 19
31. (move-drone drone1 loc6 depot)
   deleted: (at drone1 loc6)
   added: (at drone1 depot)
   goals met: 9 of 19
32. (grab-arm2 drone1 crate10 depot)
   deleted: (arm2-free drone1) (at crate10 depot)
   added: (arm2-load drone1 crate10)
   goals met: 9 of 19
33. (grab-arm1 drone1 crate11 depot)
   deleted: (arm1-free drone1) (at crate11 depot)
   added: (arm1-load drone1 crate11)
   goals met: 9 of 19
34. (move-drone drone1 depot loc3)
   deleted: (at drone1 depot)
   added: (at drone1 loc3)
   goals met: 8 of 19
35. (deliver-arm2 drone1 person3 crate10 food loc3)
   deleted: (arm2-load drone1 crate10) (person-needs person3 food)
   added: (arm2-free drone1) (person-has person3 food)
   goals met: 9 of 19
36. (move-drone drone1 loc3 loc8)
   deleted: (at drone1 loc3)
   added: (at drone1 loc8)
   goals met: 9 of 19
37. (deliver-arm1 drone1 person2 crate11 food loc8)
   deleted: (arm1-load drone1 crate11) (person-needs person2 food)
   added: (arm1-free drone1) (person-has person2 food)
   goals met: 10 of 19
38. (move-drone drone1 loc8 depot)
   deleted: (at drone1 loc8)
   added: (at drone1 depot)
   goals met: 11 of 19
39. (grab-arm2 drone1 crate4 depot)
   deleted: (arm2-free drone1) (at crate4 depot)
   added: (arm2-load drone1 crate4)
   goals met: 11 of 19
40. (grab-arm1 drone1 crate6 depot)
   deleted: (arm1-free drone1) (at crate6 depot)
   added: (arm1-load drone1 crate6)
   goals met: 11 of 19
41. (move-drone drone1 depot loc6)
   deleted: (at drone1 depot)
   added: (at drone1 loc6)
   goals met: 10 of 19
42. (deliver-arm2 drone1 person10 crate4 food loc6)
   deleted: (arm2-load drone1 crate4) (person-needs person10 food)
   added: (arm2-free drone1) (person-has person10 food)
   goals met: 11 of 19
43. (move-drone drone1 loc6 loc3)
   deleted: (at drone1 loc6)
   added: (at drone1 loc3)
   goals met: 11 of 19
44. (deliver-arm1 drone1 person13 crate6 food loc3)
   deleted: (arm1-load drone1 crate6) (person-needs person13 food)
   added: (arm1-free drone1) (person-has person13 food)
   goals met: 12 of 19
45. (move-drone drone1 loc3 depot)
   deleted: (at drone1 loc3)
   added: (at drone1 depot)
   goals met: 13 of 19
46. (grab-arm1 drone1 crate12 depot)
   deleted: (arm1-free drone1) (at crate12 depot)
   added: (arm1-load drone1 crate12)
   goals met: 13 of 19
47. (grab-arm2 drone1 crate7 depot)
   deleted: (arm2-free drone1) (at crate7 depot)
   added: (arm2-load drone1 crate7)
   goals met: 13 of 19
48. (move-drone drone1 depot loc14)
   deleted: (at drone1 depot)
   added: (at drone1 loc14)
   goals met: 12 of 19
49. (deliver-arm1 drone1 person14 crate12 food loc14)
   deleted: (arm1-load drone1 crate12) (person-needs person14 food)
   added: (arm1-free drone1) (person-has person14 food)
   goals met: 13 of 19
50. (move-drone drone1 loc14 loc7)
   deleted: (at drone1 loc14)
   added: (at drone1 loc7)
   goals met: 13 of 19
51. (deliver-arm2 drone1 person15 crate7 food loc7)
   deleted: (arm2-load drone1 crate7) (person-needs person15 food)
   added: (arm2-free drone1) (person-has person15 food)
   goals met: 14 of 19
52. (move-drone drone1 loc7 depot)
   deleted: (at drone1 loc7)
   added: (at drone1 depot)
   goals met: 15 of 19
53. (grab-arm1 drone1 crate14 depot)
   deleted: (arm1-free drone1) (at crate14 depot)
   added: (arm1-load drone1 crate14)
   goals met: 15 of 19
54. (grab-arm2 drone1 crate5 depot)
   deleted: (arm2-free drone1) (at crate5 depot)
   added: (arm2-load drone1 crate5)
   goals met: 15 of 19
55. (move-drone drone1 depot loc8)
   deleted: (at drone1 depot)
   added: (at drone1 loc8)
   goals met: 14 of 19
56. (deliver-arm1 drone1 person16 crate14 food loc8)
   deleted: (arm1-load drone1 crate14) (person-needs person16 food)
   added: (arm1-free drone1) (person-has person16 food)
   goals met: 15 of 19
57. (move-drone drone1 loc8 loc4)
   deleted: (at drone1 loc8)
   added: (at drone1 loc4)
   goals met: 15 of 19
58. (deliver-arm2 drone1 person17 crate5 food loc4)
   deleted: (arm2-load drone1 crate5) (person-needs person17 food)
   added: (arm2-free drone1) (person-has person17 food)
   goals met: 16 of 19
59. (move-drone drone1 loc4 depot)
   deleted: (at drone1 loc4)
   added: (at drone1 depot)
   goals met: 17 of 19
60. (grab-arm2 drone1 crate3 depot)
   deleted: (arm2-free drone1) (at crate3 depot)
   added: (arm2-load drone1 crate3)
   goals met: 17 of 19
61. (move-drone drone1 depot loc17)
   deleted: (at drone1 depot)
   added: (at drone1 loc17)
   goals met: 16 of 19
62. (deliver-arm2 drone1 person1 crate3 food loc17)
   deleted: (arm2-load drone1 crate3) (person-needs person1 food)
   added: (arm2-free drone1) (person-has person1 food)
   goals met: 17 of 19
63. (move-drone drone1 loc17 depot)
   deleted: (at drone1 loc17)
   added: (at drone1 depot)
   goals met: 18 of 19
64. (grab-arm2 drone1 crate1 depot)
   deleted: (arm2-free drone1) (at crate1 depot)
   added: (arm2-load drone1 crate1)
   goals met: 18 of 19
65. (move-drone drone1 depot loc1)
   deleted: (at drone1 depot)
   added: (at drone1 loc1)
   goals met: 17 of 19
66. (deliver-arm2 drone1 person18 crate1 food loc1)
   deleted: (arm2-load drone1 crate1) (person-needs person18 food)
   added: (arm2-free drone1) (person-has person18 food)
   goals met: 18 of 19
67. (move-drone drone1 loc1 depot)
   deleted: (at drone1 loc1)
   added: (at drone1 depot)
   goals met: 19 of 19
